---
type: IFCFileModelOptions
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 7
tags: [revit-api, class]
---

# IFCFileModelOptions

`Autodesk.Revit.DB.IFC.IFCFileModelOptions` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | IFCFileModelOptions | 2013 | `public IFCFileModelOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | CacheSize | 2013 | `public int CacheSize { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | SchemaFile | 2013 | `public string SchemaFile { get ; set ; }` |
| Property | SchemaName | 2013 | `public string SchemaName { get ; set ; }` |
| Property | UserControlledInverses | 2013 | `public bool UserControlledInverses { get ; set ; }` |